[
  {
    "user": "User 20",
    "message": "What is the difference between SarawakID and SarawakID Corp?",
    "response": "SarawakID is a personal identification system used by individuals to access various online services and applications in Sarawak. It is a verified account that serves as a digital identity for personal use. On the other hand, SarawakID Corp (Corporate) is designed specifically for businesses or corporate entities. It requires registration through a verified SarawakID account, and the process involves additional steps such as providing corporate information, uploading a Corporate Registration Certificate, and verifying the corporate email address. The SarawakID Corp account allows businesses to access services and applications that are applicable to corporate entities. In summary, SarawakID is for individual users, whereas SarawakID Corp is for corporate or business users.",
    "fullResponseTime": 13184,
    "firstResponseTime": 6072,
    "apdexRating": "Satisfactory",
    "cpuUsagePercent": "52.30%",
    "memoryUsageRSS": "0.54%"
  },
  {
    "user": "User 20",
    "message": "I cant register my SarawakID bc it says that my IC has been registered before, what should i do",
    "response": "If you are unable to register your SarawakID because your IC (Identification Card) has been registered before, it is possible that an account has already been created using your IC. Here are a few steps you can take to address this issue: Contact Support: Reach out to SarawakID support for assistance. They can help you determine if an account is already associated with your IC and provide guidance on how to proceed. Visit a Service Sarawak Kiosk or Counter: You can visit a Service Sarawak Kiosk or Counter with your MyKad or passport. The staff there should be able to assist you with your registration issue. Check for Previous Registrations: If you suspect that you might have registered before, try to recover your account by using any previously associated email address or phone number for password recovery. Verify Your Account: If you have an unverified account, you might need to go through the verification process at a Service Sarawak Counter, Kiosk, or use the eKYC Online method. Taking these steps should help you resolve the issue and successfully register or recover your SarawakID.",
    "fullResponseTime": 14644,
    "firstResponseTime": 6433,
    "apdexRating": "Satisfactory",
    "cpuUsagePercent": "59.74%",
    "memoryUsageRSS": "0.54%"
  },
  {
    "user": "User 20",
    "message": "What is SarawakID?",
    "response": "SarawakID is an individual's single-sign-on identity that provides secure access to Sarawak Government digital services. It allows users to easily access various online services and applications offered by the Sarawak Government. There are two versions of SID: SarawakID for individuals and SarawakID Corp for corporations.",
    "fullResponseTime": 11778,
    "firstResponseTime": 6722,
    "apdexRating": "Satisfactory",
    "cpuUsagePercent": "60.73%",
    "memoryUsageRSS": "0.55%"
  },
  {
    "user": "User 20",
    "message": "What is a SEG Portal?",
    "response": "SEG Portal is the Sarawak Government's online platform that serves as a comprehensive resource for accessing all Sarawak government services and information. It provides users with a centralized location to find and utilize various online services offered by the Sarawak Government. To access these services, users need to register for a SarawakID account.",
    "fullResponseTime": 11173,
    "firstResponseTime": 6127,
    "apdexRating": "Satisfactory",
    "cpuUsagePercent": "61.00%",
    "memoryUsageRSS": "0.58%"
  },
  {
    "user": "User 20",
    "message": "How much is the fee for upgrading the registration class in the electrical field?",
    "response": "The request regarding the fee for upgrading the registration class in the electrical field is currently underway. We will provide you with the necessary information as soon as it becomes available. Thank you for your patience.",
    "fullResponseTime": 38469,
    "firstResponseTime": 8448,
    "apdexRating": "Satisfactory",
    "cpuUsagePercent": "57.23%",
    "memoryUsageRSS": "0.50%"
  }
]