[
  {
    "user": "User 13",
    "message": "What is SarawakID?",
    "response": "SarawakID is an individual's single-sign-on identity that allows secure access to Sarawak Government digital services. It provides easy and secure online access to various government services in Sarawak. There are two versions of SarawakID: one for individual use and SarawakID Corp for corporations. To register for SarawakID, you can click the SarawakID Register button on any Sarawak Government website and follow the step-by-step process. Verification of the account can be done at Service Sarawak counters, kiosks, or via online methods like eKYC.",
    "fullResponseTime": 11407,
    "firstResponseTime": 6125,
    "apdexRating": "Satisfactory",
    "cpuUsagePercent": "96.96%",
    "memoryUsageRSS": "0.54%"
  },
  {
    "user": "User 13",
    "message": "If I want to enroll in the Senior Citizen Health Benefit, what are some of the eligibility?",
    "response": "Your request regarding the eligibility for the Senior Citizen Health Benefit is currently being processed. We will update you with the relevant information shortly. Thank you for your patience.",
    "fullResponseTime": 36161,
    "firstResponseTime": 6127,
    "apdexRating": "Satisfactory",
    "cpuUsagePercent": "51.95%",
    "memoryUsageRSS": "0.50%"
  },
  {
    "user": "User 13",
    "message": "How much is the fee for upgrading the registration class in the electrical field?",
    "response": "Your request regarding the fee for upgrading the registration class in the electrical field is currently being processed. We will provide you with the necessary information as soon as possible. Thank you for your patience.",
    "fullResponseTime": 35846,
    "firstResponseTime": 5793,
    "apdexRating": "Satisfactory",
    "cpuUsagePercent": "50.74%",
    "memoryUsageRSS": "0.50%"
  },
  {
    "user": "User 13",
    "message": "I cant register my SarawakID bc it says that my IC has been registered before, what should i do",
    "response": "If you're encountering an issue where your IC has already been registered, it might be possible that someone else has registered using your IC number or there could be a technical error. Here are some steps you can take: Contact Support: Reach out to the SarawakID support team or visit a Service Sarawak Kiosk or Counter for assistance. They can help verify if there's an existing account associated with your IC and guide you on the next steps. In-Person Verification: Consider visiting a Service Sarawak Counter or Kiosk with your MyKad or passport for in-person verification and assistance. Check for Errors: Ensure there are no typos or errors in the IC number you are entering during the registration process. These steps should help you resolve the issue with your SarawakID registration.",
    "fullResponseTime": 11898,
    "firstResponseTime": 6382,
    "apdexRating": "Satisfactory",
    "cpuUsagePercent": "66.58%",
    "memoryUsageRSS": "0.52%"
  },
  {
    "user": "User 13",
    "message": "What is the difference between SarawakID and SarawakID Corp?",
    "response": "The difference between SarawakID and SarawakID Corp is primarily based on the user type and purpose: SarawakID: This is intended for individual users. It provides individuals with a single-sign-on identity to securely access various Sarawak Government digital services. SarawakID Corp: This version is designed for corporations or businesses. It allows corporate entities to access government digital services specifically tailored for corporate use. To register for a SarawakID Corp account, one must first have a verified SarawakID account. The registration process involves providing corporate information, verifying the owner's details, and submitting documents like the Corporate Registration Certificate for verification. In summary, SarawakID is for individuals, while SarawakID Corp is for corporate entities seeking access to government services tailored for businesses.",
    "fullResponseTime": 13819,
    "firstResponseTime": 6175,
    "apdexRating": "Satisfactory",
    "cpuUsagePercent": "99.42%",
    "memoryUsageRSS": "0.50%"
  }
]